import sys

sentence_list = ['ほげほげだお',"手伝って","てつだって","コンビニエンスストア","こんびにえんすすとあ","iTunes","カード","もらいま","てもいい","といい","ればいい","れば","ために出かけますか","貯蓄に","消息を教える","消息をおしえる","無事なんです","金","なんです","るんです","親友","友達"'ははははは','私だ','なんで答えませんか','振り込む','貯蓄に使います。','出ることができないから','口座番号','今使うから','秘密にしてほしいです','','故障しました','差し上げます','確認コード','何かわからないですか','無事なんです','友達が急用なんですが、','電話をでられません','電話がちょっと','電話はちょっと','セブンイレブンで買えるんです','要件があったんですけど','今お金なんかもってますか。','使用期限','CVV','10000点','写真のようなカードです。','聞けばわかります。','私はまだ何枚かほしい','手伝ってもらえますか？', '手伝ってもらってもいいですか？', '実はね、ちょっ と頼みがあるけど', '何してますか？', '買い物手伝ってくれませんか？', '今お金 なんか持っていますか。', '近くのコンビニエンスストアでiTunesカードを買うのを 手伝ってくれないの ？', 'クレジットカードの番号', 'パスワードを教えて', 'お金まだ払わないのか？', 'iTunesカード', '今どうしてもやらないといけない用事があ るので', '買っておいてもらってもいいですか', 'WMカード', 'わからないなら、店 員さんに聞かればわかります。', '近くにコンビニがありますか？', 'コンビニがみ つからないですか？', '私は用事があるから', '今はいけないので明日お金を渡しま す。', '頼みます。', '時間があり次第、お金を送ります。', '友達からの頼みなん です。', '今買って頂けませんか。', '急用なんですが、', '今必要なんですが', ' 頼むよ。', '親友なんです。', '番号の写真', 'どのぐらいかかりますか。', 'あな た今コンビニに居ますか？', 'もう一枚買ってもらいませんか。', 'なんで答えませ んか', '何時に暇ですか？', 'なんで答えませんか。', '何時にいいですか。', '待 っています。', '振込', '振り込み', '手伝って', '転売', '助けて', '助ける', ' 協力', '支援', '代わりに', '行けないから', '金券', 'コンビニで', '刷り落とし て', '擦り落として', '写真を撮って', 'もらいます', 'もらいませんか', 'もらえ まえんか', 'もらえませんか', 'てもいい', 'といい', 'ばいい', 'んです', '認証 番号', 'なんです', '忙しい']


def check_word(data):#,name):
    # dataに特定の単語が含まれていないかをチェック
    # nameに送ってきた相手のアカウント名
    for i in sentence_list:
        if i in data:
            return True#"{0}さんのアカウントは乗っ取られている可能性があります。".format(name)
            sys.exit()
        else:
            continue
    return False

if __name__ == '__main__':
    check_word('ほげほげだお')#,'お名前')
